app/controllers/api/v1/articles_controller.rb

SELECT `articles`.* FROM `articles` ORDER BY created_at DESC
---
      def index
        articles = Article.order('created_at DESC');

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
      def show
        article = Article.find(params[:id])

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`) VALUES ('Test Article One', 'This is the body', '2017-06-27 16:53:47', '2017-06-27 16:53:47')
---
      def create
        article = Article.new(article_params)

        if article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 6
---
      def destroy
        article = Article.find(params[:id])
        article.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1
UPDATE `articles` SET `title` = 'Updated Title', `body` = 'Updated Body', `updated_at` = '2017-06-27 16:59:30' WHERE `articles`.`id` = 5
---
      def update
        article = Article.find(params[:id])
        if article.update_attributes(article_params)